SkillOnRails/app/controllers/people_controller.rb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", "1"]]
---
	def favorites
		@people = []

		Favorite.where(user_id: current_user.id).each do |fav|

INSERT INTO "favorites" ("created_at", "updated_at", "personId", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2018-06-01 15:19:14.222664"], ["updated_at", "2018-06-01 15:19:14.222664"], ["personId", "47006"], ["user_id", "1"]]
---
	def add_to_favorites
		#current_user.add_favorite(params[:person_id])
		# redirect to shopping cart or whereever
		@favorite = Favorite.new(user_id:current_user.id, personId: params[:person_id])
		@favorite.personId = params[:person_id]

		if !@favorite.save

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."personId" = ?  [["user_id", "1"], ["personId", "47006"]]
---
	def remove_from_favorites
		Favorite.where(user_id: current_user.id, personId: params[:person_id]).destroy_all