SkillOnRails/app/controllers/sessions_controller.rb

  def create
	user = User.find_by(username: params[:session][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "1"], ["LIMIT", 1]]