SkillOnRails/app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["username", "111"], ["created_at", "2018-06-01 15:19:04.757192"], ["updated_at", "2018-06-01 15:19:04.757192"], ["password_digest", "$2a$10$KLzRewYynPETWIe3aQpcYe9sPqHjgrT9PXY67oD6sJg/x5INsY1Ie"]]